[Killed] StringLiteral
src/checks/projects.js:3:9
 export default function projects(repo, projectsData) {
   let response = {
-    id: "projects",
+    id: "",
     href: "/repo/projects",
     title: "Projects",
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have project boards enabled and it is being used.",
    "extra": "No action required.",

[Survived] BooleanLiteral
src/checks/projects.js:8:7
     title: "Projects",
   };
 
-  if (!repo.has_projects) {
+  if (repo.has_projects) {
     response.status = "success";
     response.description = "You are not using the project board.";

[Survived] ConditionalExpression
src/checks/projects.js:8:7
     title: "Projects",
   };
 
-  if (!repo.has_projects) {
+  if (true) {
     response.status = "success";
     response.description = "You are not using the project board.";

[NoCoverage] StringLiteral
src/checks/projects.js:10:28
 
   if (!repo.has_projects) {
     response.status = "success";
-    response.description = "You are not using the project board.";
+    response.description = "";
     response.extra = "No action required.";
   }

[Killed] MethodExpression
src/checks/projects.js:14:32
     response.extra = "No action required.";
   }
 
-  const filteredProjectsData = projectsData.filter(
-    (project) => !project.closed,
-  ); // filter out closed projects
+  const filteredProjectsData = projectsData; // filter out closed projects
 
   if (repo.has_projects && filteredProjectsData.length > 0) {
killedBy: projects() projects method Edge Cases should return error when repo has projects but all are closed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have project boards enabled but it is not being used.",
-   "extra": "Hide projects boards in settings.",

[Killed] BooleanLiteral
src/checks/projects.js:15:18
   }
 
   const filteredProjectsData = projectsData.filter(
-    (project) => !project.closed,
+    (project) => project.closed,
   ); // filter out closed projects
 
killedBy: projects() projects method Edge Cases should return error when repo has projects but all are closed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have project boards enabled but it is not being used.",
-   "extra": "Hide projects boards in settings.",

[Killed] ArrowFunction
src/checks/projects.js:15:5
   }
 
   const filteredProjectsData = projectsData.filter(
-    (project) => !project.closed,
+    () => undefined,
   ); // filter out closed projects
 
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have project boards enabled and it is being used.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/projects.js:18:7
     (project) => !project.closed,
   ); // filter out closed projects
 
-  if (repo.has_projects && filteredProjectsData.length > 0) {
+  if (false) {
     response.status = "success";
     response.description =
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have project boards enabled and it is being used.",
-   "extra": "No action required.",

[Killed] BlockStatement
src/checks/projects.js:18:61
     (project) => !project.closed,
   ); // filter out closed projects
 
-  if (repo.has_projects && filteredProjectsData.length > 0) {
-    response.status = "success";
-    response.description =
-      "You have project boards enabled and it is being used.";
-    response.extra = "No action required.";
-  }
+  if (repo.has_projects && filteredProjectsData.length > 0) {}
 
   if (repo.has_projects && filteredProjectsData.length === 0) {
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have project boards enabled and it is being used.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/projects.js:19:23
   ); // filter out closed projects
 
   if (repo.has_projects && filteredProjectsData.length > 0) {
-    response.status = "success";
+    response.status = "";
     response.description =
       "You have project boards enabled and it is being used.";
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have project boards enabled and it is being used.",
    "extra": "No action required.",

[Killed] StringLiteral
src/checks/projects.js:21:7
   if (repo.has_projects && filteredProjectsData.length > 0) {
     response.status = "success";
     response.description =
-      "You have project boards enabled and it is being used.";
+      "";
     response.extra = "No action required.";
   }
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You have project boards enabled and it is being used.",

[Killed] ConditionalExpression
src/checks/projects.js:25:7
     response.extra = "No action required.";
   }
 
-  if (repo.has_projects && filteredProjectsData.length === 0) {
+  if (true) {
     response.status = "error";
     response.description =
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have project boards enabled and it is being used.",
-   "extra": "No action required.",

[Killed] LogicalOperator
src/checks/projects.js:25:7
     response.extra = "No action required.";
   }
 
-  if (repo.has_projects && filteredProjectsData.length === 0) {
+  if (repo.has_projects || filteredProjectsData.length === 0) {
     response.status = "error";
     response.description =
killedBy: projects() projects method Happy Path should return success when repo has projects and there are open projects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have project boards enabled and it is being used.",
-   "extra": "No action required.",
