[Killed] StringLiteral
src/checks/release.js:11:9
   const diff = differenceInDays(now, last);
 
   let response = {
-    id: "release",
+    id: "",
     href: "/repo/status",
     title: "Release",
killedBy: release() release method Happy Path should return success when the release is recent (<= 30 days)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "Your project has a recent release.",
    "extra": "No action required.",

[Survived] BooleanLiteral
src/checks/release.js:16:7
     title: "Release",
   };
 
-  if (!release.created_at) {
+  if (release.created_at) {
     response.status = "error";
     response.description = "There are no releases.";

[NoCoverage] BlockStatement
src/checks/release.js:16:28
     title: "Release",
   };
 
-  if (!release.created_at) {
-    response.status = "error";
-    response.description = "There are no releases.";
-    response.extra =
-      "If your project is ready for people to use, it is recommended to create a release.";
-  }
+  if (!release.created_at) {}
 
   if (diff <= min) {

[NoCoverage] StringLiteral
src/checks/release.js:17:23
   };
 
   if (!release.created_at) {
-    response.status = "error";
+    response.status = "";
     response.description = "There are no releases.";
     response.extra =

[Killed] EqualityOperator
src/checks/release.js:23:7
       "If your project is ready for people to use, it is recommended to create a release.";
   }
 
-  if (diff <= min) {
+  if (diff > min) {
     response.status = "success";
     response.description = "Your project has a recent release.";
killedBy: release() release method Happy Path should return success when the release is recent (<= 30 days)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "Your project has a recent release.",
-   "extra": "No action required.",

[Killed] BlockStatement
src/checks/release.js:23:20
       "If your project is ready for people to use, it is recommended to create a release.";
   }
 
-  if (diff <= min) {
-    response.status = "success";
-    response.description = "Your project has a recent release.";
-    response.extra = "No action required.";
-  }
+  if (diff <= min) {}
 
   if (diff > min && diff < max) {
killedBy: release() release method Happy Path should return success when the release is recent (<= 30 days)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "Your project has a recent release.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/release.js:26:22
   if (diff <= min) {
     response.status = "success";
     response.description = "Your project has a recent release.";
-    response.extra = "No action required.";
+    response.extra = "";
   }
 
killedBy: release() release method Happy Path should return success when the release is recent (<= 30 days)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "Your project has a recent release.",
-   "extra": "No action required.",

[Killed] EqualityOperator
src/checks/release.js:29:21
     response.extra = "No action required.";
   }
 
-  if (diff > min && diff < max) {
+  if (diff > min && diff >= max) {
     response.status = "warning";
     response.description = "Your project might need a more recent release.";
killedBy: release() release method Happy Path should return warning when the release is between 31 and 89 days
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "Your project might need a more recent release.",
-   "extra": "Are there any improvments you wish to collect together and release?",

[Killed] BlockStatement
src/checks/release.js:29:33
     response.extra = "No action required.";
   }
 
-  if (diff > min && diff < max) {
-    response.status = "warning";
-    response.description = "Your project might need a more recent release.";
-    response.extra =
-      "Are there any improvments you wish to collect together and release?";
-  }
+  if (diff > min && diff < max) {}
 
   if (diff >= max) {
killedBy: release() release method Happy Path should return warning when the release is between 31 and 89 days
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "Your project might need a more recent release.",
-   "extra": "Are there any improvments you wish to collect together and release?",

[Killed] EqualityOperator
src/checks/release.js:36:7
       "Are there any improvments you wish to collect together and release?";
   }
 
-  if (diff >= max) {
+  if (diff > max) {
     response.status = "error";
     response.description = `There has been no release for ${diff} days.`;
killedBy: release() release method Edge Cases should return error when the release is exactly 90 days old
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "There has been no release for 90 days.",
-   "extra": "Are there any features or bugs that can be implemented?",

[Killed] EqualityOperator
src/checks/release.js:36:7
       "Are there any improvments you wish to collect together and release?";
   }
 
-  if (diff >= max) {
+  if (diff < max) {
     response.status = "error";
     response.description = `There has been no release for ${diff} days.`;
killedBy: release() release method Happy Path should return success when the release is recent (<= 30 days)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "Your project has a recent release.",
-   "extra": "No action required.",
