[Survived] StringLiteral
src/checks/topics.js:7:11
 
   let response = {
     id: "topics",
-    href: "/repo/status",
+    href: "",
     title: "Topic",
   };

[Survived] StringLiteral
src/checks/topics.js:8:12
   let response = {
     id: "topics",
     href: "/repo/status",
-    title: "Topic",
+    title: "",
   };
 

[Killed] ConditionalExpression
src/checks/topics.js:11:7
     title: "Topic",
   };
 
-  if (repo.topics.length > 0) {
+  if (false) {
     response.status = "success";
     response.description = "You have a good number of repo topics.";
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: undefined

[Killed] EqualityOperator
src/checks/topics.js:11:7
     title: "Topic",
   };
 
-  if (repo.topics.length > 0) {
+  if (repo.topics.length <= 0) {
     response.status = "success";
     response.description = "You have a good number of repo topics.";
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: undefined

[Killed] StringLiteral
src/checks/topics.js:12:23
   };
 
   if (repo.topics.length > 0) {
-    response.status = "success";
+    response.status = "";
     response.description = "You have a good number of repo topics.";
     response.extra = "No action required.";
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: ""

[Killed] StringLiteral
src/checks/topics.js:14:22
   if (repo.topics.length > 0) {
     response.status = "success";
     response.description = "You have a good number of repo topics.";
-    response.extra = "No action required.";
+    response.extra = "";
   }
 
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No action required."
Received: ""

[Killed] EqualityOperator
src/checks/topics.js:17:7
     response.extra = "No action required.";
   }
 
-  if (repo.topics === 0) {
+  if (repo.topics !== 0) {
     response.status = "error";
     response.description = "There are no repo topics at the top right.";
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: "error"

[Killed] ConditionalExpression
src/checks/topics.js:17:7
     response.extra = "No action required.";
   }
 
-  if (repo.topics === 0) {
+  if (true) {
     response.status = "error";
     response.description = "There are no repo topics at the top right.";
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: "error"

[Killed] BlockStatement
src/checks/topics.js:23:33
     response.extra = "It is important to be discoverable using topics.";
   }
 
-  if (repo.topics.length < min) {
-    response.status = "warning";
-    response.description = "You should add some more topics.";
-    response.extra = "Try to include more topics.";
-  }
+  if (repo.topics.length < min) {}
 
   if (repo.topics.length > max) {
killedBy: topics() topics method Edge Cases should return warning when topics length is less than min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warning"
Received: "success"

[Killed] EqualityOperator
src/checks/topics.js:23:7
     response.extra = "It is important to be discoverable using topics.";
   }
 
-  if (repo.topics.length < min) {
+  if (repo.topics.length <= min) {
     response.status = "warning";
     response.description = "You should add some more topics.";
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: "warning"

[Killed] StringLiteral
src/checks/topics.js:25:28
 
   if (repo.topics.length < min) {
     response.status = "warning";
-    response.description = "You should add some more topics.";
+    response.description = "";
     response.extra = "Try to include more topics.";
   }
killedBy: topics() topics method Edge Cases should return warning when topics length is less than min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "You should add some more topics."
Received: ""

[Killed] StringLiteral
src/checks/topics.js:26:22
   if (repo.topics.length < min) {
     response.status = "warning";
     response.description = "You should add some more topics.";
-    response.extra = "Try to include more topics.";
+    response.extra = "";
   }
 
killedBy: topics() topics method Edge Cases should return warning when topics length is less than min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Try to include more topics."
Received: ""

[Killed] BlockStatement
src/checks/topics.js:29:33
     response.extra = "Try to include more topics.";
   }
 
-  if (repo.topics.length > max) {
-    response.status = "warning";
-    response.description = "You may have too many topics.";
-    response.extra = "Try reducing the amount of your topics.";
-  }
+  if (repo.topics.length > max) {}
 
   return response;
killedBy: topics() topics method Edge Cases should return warning when topics length is more than max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warning"
Received: "success"

[Killed] EqualityOperator
src/checks/topics.js:29:7
     response.extra = "Try to include more topics.";
   }
 
-  if (repo.topics.length > max) {
+  if (repo.topics.length <= max) {
     response.status = "warning";
     response.description = "You may have too many topics.";
killedBy: topics() topics method Happy Path should return success when topics length is between min and max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: "warning"

[Killed] StringLiteral
src/checks/topics.js:30:23
   }
 
   if (repo.topics.length > max) {
-    response.status = "warning";
+    response.status = "";
     response.description = "You may have too many topics.";
     response.extra = "Try reducing the amount of your topics.";
killedBy: topics() topics method Edge Cases should return warning when topics length is more than max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warning"
Received: ""

[Killed] StringLiteral
src/checks/topics.js:31:28
 
   if (repo.topics.length > max) {
     response.status = "warning";
-    response.description = "You may have too many topics.";
+    response.description = "";
     response.extra = "Try reducing the amount of your topics.";
   }
killedBy: topics() topics method Edge Cases should return warning when topics length is more than max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "You may have too many topics."
Received: ""
