[NoCoverage] BlockStatement
src/components/repo-checker.tsx:23:54
   const [repoUrl, setRepoUrl] = useState("");
   const [statusChecks, setStatusChecks] = useState<StatusCheck[]>([]);
 
-  const handleSubmit = async (e: React.FormEvent) => {
-    e.preventDefault();
-
-    // get repo data from github
-    const { owner, repo } = extractOwnerRepo(repoUrl);
-    const res = await fetch(`https://api.github.com/repos/${owner}/${repo}`, {
-      next: { revalidate: 3600 },
-    });
-    const data: Data = {
-      repo: await res.json(),
-    };
-
-    // run checks
-    const reportData = checks(data);
-    console.log(reportData);
-
-    // In a real application, you would fetch this data from an API
-    // Here we're simulating the checks with dummy data
-    setStatusChecks(reportData.allChecks);
-  };
+  const handleSubmit = async (e: React.FormEvent) => {};
 
   return (

[NoCoverage] ArrowFunction
src/components/repo-checker.tsx:61:27
                 type="url"
                 placeholder="https://github.com/username/repo"
                 value={repoUrl}
-                onChange={(e) => setRepoUrl(e.target.value)}
+                onChange={() => undefined}
                 required
               />

[NoCoverage] LogicalOperator
src/components/repo-checker.tsx:70:8
         </CardContent>
       </Card>
 
-      {statusChecks.length > 0 && (
-        <Report repoUrl={repoUrl} statusChecks={statusChecks} />
-      )}
+      {statusChecks.length > 0 || <Report repoUrl={repoUrl} statusChecks={statusChecks} />}
     </div>
   );

[NoCoverage] ConditionalExpression
src/components/repo-checker.tsx:70:8
         </CardContent>
       </Card>
 
-      {statusChecks.length > 0 && (
-        <Report repoUrl={repoUrl} statusChecks={statusChecks} />
-      )}
+      {true}
     </div>
   );
