[Killed] StringLiteral
src/checks/activity.js:11:9
   const diff = differenceInDays(now, last);
 
   let response = {
-    id: "activity",
+    id: "",
     href: "/repo/status",
     title: "Activity",
killedBy: activity() activity method Happy Path should return success status when the project is active (diff <= 7)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "Your project is active.",
    "extra": "No action required.",

[Killed] BlockStatement
src/checks/activity.js:16:20
     title: "Activity",
   };
 
-  if (diff <= min) {
-    response.status = "success";
-    response.description = "Your project is active.";
-    response.extra = "No action required.";
-  }
+  if (diff <= min) {}
 
   if (diff > min && diff < max) {
killedBy: activity() activity method Happy Path should return success status when the project is active (diff <= 7)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "Your project is active.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/activity.js:18:28
 
   if (diff <= min) {
     response.status = "success";
-    response.description = "Your project is active.";
+    response.description = "";
     response.extra = "No action required.";
   }
killedBy: activity() activity method Happy Path should return success status when the project is active (diff <= 7)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "Your project is active.",

[Killed] LogicalOperator
src/checks/activity.js:22:7
     response.extra = "No action required.";
   }
 
-  if (diff > min && diff < max) {
+  if (diff > min || diff < max) {
     response.status = "warning";
     response.description = "Your project needs more recent activity.";
killedBy: activity() activity method Happy Path should return success status when the project is active (diff <= 7)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "Your project is active.",
-   "extra": "No action required.",

[Killed] EqualityOperator
src/checks/activity.js:22:7
     response.extra = "No action required.";
   }
 
-  if (diff > min && diff < max) {
+  if (diff >= min && diff < max) {
     response.status = "warning";
     response.description = "Your project needs more recent activity.";
killedBy: activity() activity method Edge Cases should return success status when diff is exactly 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: "warning"

[Killed] StringLiteral
src/checks/activity.js:23:23
   }
 
   if (diff > min && diff < max) {
-    response.status = "warning";
+    response.status = "";
     response.description = "Your project needs more recent activity.";
     response.extra = "Are there any bugs that can be fixed?";
killedBy: activity() activity method Happy Path should return warning status when the project needs more recent activity (7 < diff < 30)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "Your project needs more recent activity.",
    "extra": "Are there any bugs that can be fixed?",

[Killed] StringLiteral
src/checks/activity.js:24:28
 
   if (diff > min && diff < max) {
     response.status = "warning";
-    response.description = "Your project needs more recent activity.";
+    response.description = "";
     response.extra = "Are there any bugs that can be fixed?";
   }
killedBy: activity() activity method Happy Path should return warning status when the project needs more recent activity (7 < diff < 30)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "Your project needs more recent activity.",

[Killed] BlockStatement
src/checks/activity.js:28:20
     response.extra = "Are there any bugs that can be fixed?";
   }
 
-  if (diff >= max) {
-    response.status = "error";
-    response.description = `There has been no activity for ${diff} days.`;
-    response.extra = "Are there any features that can be implemented?";
-  }
+  if (diff >= max) {}
 
   return response;
killedBy: activity() activity method Happy Path should return error status when there has been no activity for 30 or more days (diff >= 30)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "There has been no activity for 45 days.",
-   "extra": "Are there any features that can be implemented?",
