[Killed] BlockStatement
src/app/page.tsx:3:32
 import { RepoChecker } from "@/components/repo-checker";
 
-export default function Home() {
-  return <RepoChecker />;
-}
+export default function Home() {}
 
killedBy: Home() Home method Happy Path should render the RepoChecker component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="repo-checker"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
