[Survived] ObjectLiteral
src/app/layout.tsx:16:35
   weight: "100 900",
 });
 
-export const metadata: Metadata = {
-  title: "Create Next App",
-  description: "Generated by create next app",
-};
+export const metadata: Metadata = {};
 
 export default function RootLayout({

[Survived] StringLiteral
src/app/layout.tsx:17:10
 });
 
 export const metadata: Metadata = {
-  title: "Create Next App",
+  title: "",
   description: "Generated by create next app",
 };

[Survived] StringLiteral
src/app/layout.tsx:18:16
 
 export const metadata: Metadata = {
   title: "Create Next App",
-  description: "Generated by create next app",
+  description: "",
 };
 

[Killed] BlockStatement
src/app/layout.tsx:25:5
   children,
 }: Readonly<{
   children: React.ReactNode;
-}>) {
-  return (
-    <html lang="en">
-      <body
-        className={`${geistSans.variable} ${geistMono.variable} antialiased`}
-      >
-        {children}
-      </body>
-    </html>
-  );
-}
+}>) {}
 
killedBy: RootLayout() RootLayout method Happy Path should render children correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Child. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
src/app/layout.tsx:29:20
   return (
     <html lang="en">
       <body
-        className={`${geistSans.variable} ${geistMono.variable} antialiased`}
+        className={``}
       >
         {children}
killedBy: RootLayout() RootLayout method Happy Path should apply the correct classes to the body element
statusReason: Error: expect(element).toHaveClass("antialiased")

Expected the element to have class:
  antialiased
Received:
