[Killed] StringLiteral
src/checks/branches.js:7:11
 
   let response = {
     id: "branches",
-    href: "/repo/status",
+    href: "",
     title: "Branches",
   };
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a small amount of branches.",
    "extra": "No action required",

[Killed] BlockStatement
src/checks/branches.js:11:18
     title: "Branches",
   };
 
-  if (!branches) {
-    return {
-      ...response,
-      status: "-",
-      description: "No data available",
-      extra: "-",
-    };
-  }
+  if (!branches) {}
 
   if (branches.length <= min) {
killedBy: branches() branches method Edge Cases should return no data available when branches is null
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] BooleanLiteral
src/checks/branches.js:11:7
     title: "Branches",
   };
 
-  if (!branches) {
+  if (branches) {
     return {
       ...response,
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a small amount of branches.",
-   "extra": "No action required",

[Killed] ObjectLiteral
src/checks/branches.js:12:12
   };
 
   if (!branches) {
-    return {
-      ...response,
-      status: "-",
-      description: "No data available",
-      extra: "-",
-    };
+    return {};
   }
 
killedBy: branches() branches method Edge Cases should return no data available when branches is null
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "description": "No data available",
-   "extra": "-",

[Killed] StringLiteral
src/checks/branches.js:14:15
   if (!branches) {
     return {
       ...response,
-      status: "-",
+      status: "",
       description: "No data available",
       extra: "-",
killedBy: branches() branches method Edge Cases should return no data available when branches is null
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "No data available",
    "extra": "-",

[Killed] StringLiteral
src/checks/branches.js:16:14
       ...response,
       status: "-",
       description: "No data available",
-      extra: "-",
+      extra: "",
     };
   }
killedBy: branches() branches method Edge Cases should return no data available when branches is null
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "No data available",
-   "extra": "-",

[Killed] EqualityOperator
src/checks/branches.js:20:7
     };
   }
 
-  if (branches.length <= min) {
+  if (branches.length > min) {
     response.status = "success";
     response.description = "You have a small amount of branches.";
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a small amount of branches.",
-   "extra": "No action required",

[Killed] EqualityOperator
src/checks/branches.js:20:7
     };
   }
 
-  if (branches.length <= min) {
+  if (branches.length < min) {
     response.status = "success";
     response.description = "You have a small amount of branches.";
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a small amount of branches.",
-   "extra": "No action required",

[Killed] StringLiteral
src/checks/branches.js:21:23
   }
 
   if (branches.length <= min) {
-    response.status = "success";
+    response.status = "";
     response.description = "You have a small amount of branches.";
     response.extra = "No action required";
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a small amount of branches.",
    "extra": "No action required",

[Killed] StringLiteral
src/checks/branches.js:22:28
 
   if (branches.length <= min) {
     response.status = "success";
-    response.description = "You have a small amount of branches.";
+    response.description = "";
     response.extra = "No action required";
   }
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You have a small amount of branches.",

[Killed] EqualityOperator
src/checks/branches.js:26:7
     response.extra = "No action required";
   }
 
-  if (branches.length > min && branches.length <= max) {
+  if (branches.length <= min && branches.length <= max) {
     response.status = "warning";
     response.description = `You have ${branches.length} number of branches which is higher than the recommended`;
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a small amount of branches.",
-   "extra": "No action required",

[Killed] EqualityOperator
src/checks/branches.js:26:7
     response.extra = "No action required";
   }
 
-  if (branches.length > min && branches.length <= max) {
+  if (branches.length >= min && branches.length <= max) {
     response.status = "warning";
     response.description = `You have ${branches.length} number of branches which is higher than the recommended`;
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a small amount of branches.",
-   "extra": "No action required",

[Killed] EqualityOperator
src/checks/branches.js:32:7
     response.extra = "Are any of these branhes stale and can be deleted?";
   }
 
-  if (branches.length > max) {
+  if (branches.length >= max) {
     response.status = "error";
     response.description =
killedBy: branches() branches method Edge Cases should return warning status when branches length is exactly max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have 10 number of branches which is higher than the recommended",
-   "extra": "Are any of these branhes stale and can be deleted?",

[Killed] ConditionalExpression
src/checks/branches.js:32:7
     response.extra = "Are any of these branhes stale and can be deleted?";
   }
 
-  if (branches.length > max) {
+  if (true) {
     response.status = "error";
     response.description =
killedBy: branches() branches method Happy Path should return success status when branches length is less than or equal to min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a small amount of branches.",
-   "extra": "No action required",

[Killed] StringLiteral
src/checks/branches.js:35:7
   if (branches.length > max) {
     response.status = "error";
     response.description =
-      "You have a high number of branches, which can cause confusion.";
+      "";
     response.extra = "Can any of these branches be removed?";
   }
killedBy: branches() branches method Happy Path should return error status when branches length is greater than max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You have a high number of branches, which can cause confusion.",
