[Killed] BlockStatement
src/checks/codeOfConduct.js:1:57
-export default function codeOfConduct(communityMetrics) {
-  let response = {
-    id: "code-of-conduct",
-    href: "/repo/code-of-conduct",
-    title: "Code of Conduct",
-  };
-
-  if (communityMetrics.files?.code_of_conduct) {
-    response.status = "success";
-    response.description = `You have a CoC ${communityMetrics.files.code_of_conduct.name}.`;
-    response.extra = "No action required.";
-  }
-
-  if (!communityMetrics.files || !communityMetrics.files.code_of_conduct) {
-    response.status = "error";
-    response.description = "You do not have a CoC in your repo.";
-    response.extra =
-      "This is important for people to know your project and community is safe.";
-  }
-
-  return response;
-}
+export default function codeOfConduct(communityMetrics) {}
 
killedBy: codeOfConduct() codeOfConduct method Happy Path should return success when code_of_conduct file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "You have a CoC CoC.md.", "extra": "No action required.", "href": "/repo/code-of-conduct", "id": "code-of-conduct", "status": "success", "title": "Code of Conduct"}
Received: undefined

[Killed] StringLiteral
src/checks/codeOfConduct.js:4:11
 export default function codeOfConduct(communityMetrics) {
   let response = {
     id: "code-of-conduct",
-    href: "/repo/code-of-conduct",
+    href: "",
     title: "Code of Conduct",
   };
killedBy: codeOfConduct() codeOfConduct method Happy Path should return success when code_of_conduct file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a CoC CoC.md.",
    "extra": "No action required.",

[Killed] BlockStatement
src/checks/codeOfConduct.js:8:48
     title: "Code of Conduct",
   };
 
-  if (communityMetrics.files?.code_of_conduct) {
-    response.status = "success";
-    response.description = `You have a CoC ${communityMetrics.files.code_of_conduct.name}.`;
-    response.extra = "No action required.";
-  }
+  if (communityMetrics.files?.code_of_conduct) {}
 
   if (!communityMetrics.files || !communityMetrics.files.code_of_conduct) {
killedBy: codeOfConduct() codeOfConduct method Happy Path should return success when code_of_conduct file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a CoC CoC.md.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/codeOfConduct.js:8:7
     title: "Code of Conduct",
   };
 
-  if (communityMetrics.files?.code_of_conduct) {
+  if (false) {
     response.status = "success";
     response.description = `You have a CoC ${communityMetrics.files.code_of_conduct.name}.`;
killedBy: codeOfConduct() codeOfConduct method Happy Path should return success when code_of_conduct file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a CoC CoC.md.",
-   "extra": "No action required.",

[Killed] BlockStatement
src/checks/codeOfConduct.js:14:75
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.code_of_conduct) {
-    response.status = "error";
-    response.description = "You do not have a CoC in your repo.";
-    response.extra =
-      "This is important for people to know your project and community is safe.";
-  }
+  if (!communityMetrics.files || !communityMetrics.files.code_of_conduct) {}
 
   return response;
killedBy: codeOfConduct() codeOfConduct method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have a CoC in your repo.",
-   "extra": "This is important for people to know your project and community is safe.",

[Killed] ConditionalExpression
src/checks/codeOfConduct.js:14:7
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.code_of_conduct) {
+  if (false) {
     response.status = "error";
     response.description = "You do not have a CoC in your repo.";
killedBy: codeOfConduct() codeOfConduct method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have a CoC in your repo.",
-   "extra": "This is important for people to know your project and community is safe.",

[Killed] StringLiteral
src/checks/codeOfConduct.js:15:23
   }
 
   if (!communityMetrics.files || !communityMetrics.files.code_of_conduct) {
-    response.status = "error";
+    response.status = "";
     response.description = "You do not have a CoC in your repo.";
     response.extra =
killedBy: codeOfConduct() codeOfConduct method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You do not have a CoC in your repo.",
    "extra": "This is important for people to know your project and community is safe.",

[Killed] StringLiteral
src/checks/codeOfConduct.js:16:28
 
   if (!communityMetrics.files || !communityMetrics.files.code_of_conduct) {
     response.status = "error";
-    response.description = "You do not have a CoC in your repo.";
+    response.description = "";
     response.extra =
       "This is important for people to know your project and community is safe.";
killedBy: codeOfConduct() codeOfConduct method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You do not have a CoC in your repo.",
