[Killed] BlockStatement
src/checks/contributing.js:1:56
-export default function contributing(communityMetrics) {
-  let response = {
-    id: "contributing",
-    href: "/repo/contributing",
-    title: "Contributing",
-  };
-
-  if (communityMetrics.files?.contributing) {
-    response.status = "success";
-    response.description = "You have a contributing guide.";
-    response.extra = "No action required.";
-  }
-
-  if (!communityMetrics.files || !communityMetrics.files.contributing) {
-    response.status = "error";
-    response.description = "You do not have a contributing guide in your repo.";
-    response.extra =
-      "This is important, so people know how to get started with your project.";
-  }
-
-  return response;
-}
+export default function contributing(communityMetrics) {}
 
killedBy: contributing() contributing method Happy Path should return success when contributing guide is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "You have a contributing guide.", "extra": "No action required.", "href": "/repo/contributing", "id": "contributing", "status": "success", "title": "Contributing"}
Received: undefined

[Killed] StringLiteral
src/checks/contributing.js:3:9
 export default function contributing(communityMetrics) {
   let response = {
-    id: "contributing",
+    id: "",
     href: "/repo/contributing",
     title: "Contributing",
killedBy: contributing() contributing method Happy Path should return success when contributing guide is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a contributing guide.",
    "extra": "No action required.",

[Killed] StringLiteral
src/checks/contributing.js:5:12
   let response = {
     id: "contributing",
     href: "/repo/contributing",
-    title: "Contributing",
+    title: "",
   };
 
killedBy: contributing() contributing method Happy Path should return success when contributing guide is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "description": "You have a contributing guide.",
    "extra": "No action required.",

[Killed] OptionalChaining
src/checks/contributing.js:8:7
     title: "Contributing",
   };
 
-  if (communityMetrics.files?.contributing) {
+  if (communityMetrics.files.contributing) {
     response.status = "success";
     response.description = "You have a contributing guide.";
killedBy: contributing() contributing method Edge Cases should return error when files object is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'contributing')

[Killed] BlockStatement
src/checks/contributing.js:8:45
     title: "Contributing",
   };
 
-  if (communityMetrics.files?.contributing) {
-    response.status = "success";
-    response.description = "You have a contributing guide.";
-    response.extra = "No action required.";
-  }
+  if (communityMetrics.files?.contributing) {}
 
   if (!communityMetrics.files || !communityMetrics.files.contributing) {
killedBy: contributing() contributing method Happy Path should return success when contributing guide is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a contributing guide.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/contributing.js:11:22
   if (communityMetrics.files?.contributing) {
     response.status = "success";
     response.description = "You have a contributing guide.";
-    response.extra = "No action required.";
+    response.extra = "";
   }
 
killedBy: contributing() contributing method Happy Path should return success when contributing guide is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a contributing guide.",
-   "extra": "No action required.",

[Killed] LogicalOperator
src/checks/contributing.js:14:7
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.contributing) {
+  if (!communityMetrics.files && !communityMetrics.files.contributing) {
     response.status = "error";
     response.description = "You do not have a contributing guide in your repo.";
killedBy: contributing() contributing method Edge Cases should return error when files object is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'contributing')

[Killed] BooleanLiteral
src/checks/contributing.js:14:7
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.contributing) {
+  if (communityMetrics.files || !communityMetrics.files.contributing) {
     response.status = "error";
     response.description = "You do not have a contributing guide in your repo.";
killedBy: contributing() contributing method Happy Path should return success when contributing guide is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a contributing guide.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/contributing.js:15:23
   }
 
   if (!communityMetrics.files || !communityMetrics.files.contributing) {
-    response.status = "error";
+    response.status = "";
     response.description = "You do not have a contributing guide in your repo.";
     response.extra =
killedBy: contributing() contributing method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You do not have a contributing guide in your repo.",
    "extra": "This is important, so people know how to get started with your project.",

[Killed] StringLiteral
src/checks/contributing.js:16:28
 
   if (!communityMetrics.files || !communityMetrics.files.contributing) {
     response.status = "error";
-    response.description = "You do not have a contributing guide in your repo.";
+    response.description = "";
     response.extra =
       "This is important, so people know how to get started with your project.";
killedBy: contributing() contributing method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You do not have a contributing guide in your repo.",

[Killed] StringLiteral
src/checks/contributing.js:18:7
     response.status = "error";
     response.description = "You do not have a contributing guide in your repo.";
     response.extra =
-      "This is important, so people know how to get started with your project.";
+      "";
   }
 
killedBy: contributing() contributing method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You do not have a contributing guide in your repo.",
-   "extra": "This is important, so people know how to get started with your project.",
