[Killed] BlockStatement
src/checks/defaultBranch.js:1:45
-export default function defaultBranch(repo) {
-  const defaultBranchName = "main";
-
-  let response = {
-    id: "default-branch",
-    href: "/repo/status",
-    title: "Default Branch",
-  };
-
-  if (repo.default_branch === defaultBranchName) {
-    response.status = "success";
-    response.description = "You are using the recommend default branch name.";
-    response.extra = "No action required.";
-  }
-
-  if (repo.default_branch !== defaultBranchName) {
-    response.status = "warning";
-    response.description =
-      "You are not using the recommended default branch name.";
-    response.extra = "This may confuse contributors on your project.";
-  }
-
-  return response;
-}
+export default function defaultBranch(repo) {}
 
killedBy: defaultBranch() defaultBranch method Happy Path should return success response when the default branch is "main"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "You are using the recommend default branch name.", "extra": "No action required.", "href": "/repo/status", "id": "default-branch", "status": "success", "title": "Default Branch"}
Received: undefined

[Killed] StringLiteral
src/checks/defaultBranch.js:5:9
   const defaultBranchName = "main";
 
   let response = {
-    id: "default-branch",
+    id: "",
     href: "/repo/status",
     title: "Default Branch",
killedBy: defaultBranch() defaultBranch method Happy Path should return success response when the default branch is "main"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You are using the recommend default branch name.",
    "extra": "No action required.",

[Killed] BlockStatement
src/checks/defaultBranch.js:10:50
     title: "Default Branch",
   };
 
-  if (repo.default_branch === defaultBranchName) {
-    response.status = "success";
-    response.description = "You are using the recommend default branch name.";
-    response.extra = "No action required.";
-  }
+  if (repo.default_branch === defaultBranchName) {}
 
   if (repo.default_branch !== defaultBranchName) {
killedBy: defaultBranch() defaultBranch method Happy Path should return success response when the default branch is "main"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You are using the recommend default branch name.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/defaultBranch.js:10:7
     title: "Default Branch",
   };
 
-  if (repo.default_branch === defaultBranchName) {
+  if (false) {
     response.status = "success";
     response.description = "You are using the recommend default branch name.";
killedBy: defaultBranch() defaultBranch method Happy Path should return success response when the default branch is "main"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You are using the recommend default branch name.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/defaultBranch.js:16:7
     response.extra = "No action required.";
   }
 
-  if (repo.default_branch !== defaultBranchName) {
+  if (true) {
     response.status = "warning";
     response.description =
killedBy: defaultBranch() defaultBranch method Happy Path should return success response when the default branch is "main"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You are using the recommend default branch name.",
-   "extra": "No action required.",

[Killed] BlockStatement
src/checks/defaultBranch.js:16:50
     response.extra = "No action required.";
   }
 
-  if (repo.default_branch !== defaultBranchName) {
-    response.status = "warning";
-    response.description =
-      "You are not using the recommended default branch name.";
-    response.extra = "This may confuse contributors on your project.";
-  }
+  if (repo.default_branch !== defaultBranchName) {}
 
   return response;
killedBy: defaultBranch() defaultBranch method Edge Cases should return warning response when the default branch is not "main"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You are not using the recommended default branch name.",
-   "extra": "This may confuse contributors on your project.",

[Killed] StringLiteral
src/checks/defaultBranch.js:19:7
   if (repo.default_branch !== defaultBranchName) {
     response.status = "warning";
     response.description =
-      "You are not using the recommended default branch name.";
+      "";
     response.extra = "This may confuse contributors on your project.";
   }
killedBy: defaultBranch() defaultBranch method Edge Cases should return warning response when the default branch is not "main"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You are not using the recommended default branch name.",
