[Survived] StringLiteral
src/checks/goodFirstIssue.js:7:12
   let response = {
     id: "good-first-issue",
     href: "/repo/status",
-    title: "Good First Issue",
+    title: "",
   };
 

[Killed] BooleanLiteral
src/checks/goodFirstIssue.js:10:7
     title: "Good First Issue",
   };
 
-  if (!issues) {
+  if (issues) {
     return {
       ...response,
killedBy: goodFirstIssue() goodFirstIssue method Happy Path should return success status when issues length is greater than min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: "-"

[Killed] BlockStatement
src/checks/goodFirstIssue.js:10:16
     title: "Good First Issue",
   };
 
-  if (!issues) {
-    return {
-      ...response,
-      status: "-",
-      description: "No data available",
-      extra: "-",
-    };
-  }
+  if (!issues) {}
 
   if (issues.length === 0) {
killedBy: goodFirstIssue() goodFirstIssue method Edge Cases should return default response when issues is null
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] ObjectLiteral
src/checks/goodFirstIssue.js:11:12
   };
 
   if (!issues) {
-    return {
-      ...response,
-      status: "-",
-      description: "No data available",
-      extra: "-",
-    };
+    return {};
   }
 
killedBy: goodFirstIssue() goodFirstIssue method Edge Cases should return default response when issues is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-"
Received: undefined

[Killed] StringLiteral
src/checks/goodFirstIssue.js:14:20
     return {
       ...response,
       status: "-",
-      description: "No data available",
+      description: "",
       extra: "-",
     };
killedBy: goodFirstIssue() goodFirstIssue method Edge Cases should return default response when issues is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No data available"
Received: ""

[Killed] BlockStatement
src/checks/goodFirstIssue.js:19:28
     };
   }
 
-  if (issues.length === 0) {
-    response.status = "error";
-    response.description = "You have no open and unassigned good first issues";
-    response.extra =
-      "You will not be appearing in the issue and label search on GitHub";
-  }
+  if (issues.length === 0) {}
 
   if (issues.length > 0 && issues.length <= min) {
killedBy: goodFirstIssue() goodFirstIssue method Edge Cases should return error status when issues array is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error"
Received: undefined

[Killed] ConditionalExpression
src/checks/goodFirstIssue.js:19:7
     };
   }
 
-  if (issues.length === 0) {
+  if (false) {
     response.status = "error";
     response.description = "You have no open and unassigned good first issues";
killedBy: goodFirstIssue() goodFirstIssue method Edge Cases should return error status when issues array is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error"
Received: undefined

[Killed] StringLiteral
src/checks/goodFirstIssue.js:20:23
   }
 
   if (issues.length === 0) {
-    response.status = "error";
+    response.status = "";
     response.description = "You have no open and unassigned good first issues";
     response.extra =
killedBy: goodFirstIssue() goodFirstIssue method Edge Cases should return error status when issues array is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error"
Received: ""

[Killed] BlockStatement
src/checks/goodFirstIssue.js:26:50
       "You will not be appearing in the issue and label search on GitHub";
   }
 
-  if (issues.length > 0 && issues.length <= min) {
-    response.status = "warning";
-    response.description = `You currently only have ${issues.length} issue that has the label good first issue and is not already assigned`;
-    response.extra = "These need to be open and not already assigned";
-  }
+  if (issues.length > 0 && issues.length <= min) {}
 
   if (issues.length > min) {
killedBy: goodFirstIssue() goodFirstIssue method Happy Path should return warning status when issues length is equal to min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warning"
Received: undefined

[Killed] EqualityOperator
src/checks/goodFirstIssue.js:26:7
       "You will not be appearing in the issue and label search on GitHub";
   }
 
-  if (issues.length > 0 && issues.length <= min) {
+  if (issues.length >= 0 && issues.length <= min) {
     response.status = "warning";
     response.description = `You currently only have ${issues.length} issue that has the label good first issue and is not already assigned`;
killedBy: goodFirstIssue() goodFirstIssue method Edge Cases should return error status when issues array is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error"
Received: "warning"

[Killed] StringLiteral
src/checks/goodFirstIssue.js:27:23
   }
 
   if (issues.length > 0 && issues.length <= min) {
-    response.status = "warning";
+    response.status = "";
     response.description = `You currently only have ${issues.length} issue that has the label good first issue and is not already assigned`;
     response.extra = "These need to be open and not already assigned";
killedBy: goodFirstIssue() goodFirstIssue method Happy Path should return warning status when issues length is equal to min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warning"
Received: ""

[Killed] BlockStatement
src/checks/goodFirstIssue.js:32:28
     response.extra = "These need to be open and not already assigned";
   }
 
-  if (issues.length > min) {
-    response.status = "success";
-    response.description =
-      "Great you have open issues with the label good first issue that are ready to be assigned";
-    response.extra = "No action required";
-  }
+  if (issues.length > min) {}
 
   return response;
killedBy: goodFirstIssue() goodFirstIssue method Happy Path should return success status when issues length is greater than min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: undefined

[Killed] EqualityOperator
src/checks/goodFirstIssue.js:32:7
     response.extra = "These need to be open and not already assigned";
   }
 
-  if (issues.length > min) {
+  if (issues.length >= min) {
     response.status = "success";
     response.description =
killedBy: goodFirstIssue() goodFirstIssue method Happy Path should return warning status when issues length is equal to min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warning"
Received: "success"

[Killed] StringLiteral
src/checks/goodFirstIssue.js:33:23
   }
 
   if (issues.length > min) {
-    response.status = "success";
+    response.status = "";
     response.description =
       "Great you have open issues with the label good first issue that are ready to be assigned";
killedBy: goodFirstIssue() goodFirstIssue method Happy Path should return success status when issues length is greater than min
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: ""
