[Killed] BlockStatement
src/checks/issueTemplates.js:1:58
-export default function issueTemplates(communityMetrics) {
-  let response = {
-    id: "issue-templates",
-    href: "/repo/issue-templates",
-    title: "Issue templates",
-  };
-
-  if (communityMetrics.files.issue_template) {
-    response.status = "success";
-    response.description = "You have issue templates.";
-    response.extra = "No action required.";
-  }
-
-  if (!communityMetrics.files.issue_template) {
-    response.status = "error";
-    response.description = "You do not have any issue templates in your repo.";
-    response.extra =
-      "This helps people create better issues, for example focused on a feature or bug.";
-  }
-
-  return response;
-}
+export default function issueTemplates(communityMetrics) {}
 
killedBy: issueTemplates() issueTemplates method Happy Path should return success status when issue_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "You have issue templates.", "extra": "No action required.", "href": "/repo/issue-templates", "id": "issue-templates", "status": "success", "title": "Issue templates"}
Received: undefined

[Killed] ObjectLiteral
src/checks/issueTemplates.js:2:18
 export default function issueTemplates(communityMetrics) {
-  let response = {
-    id: "issue-templates",
-    href: "/repo/issue-templates",
-    title: "Issue templates",
-  };
+  let response = {};
 
   if (communityMetrics.files.issue_template) {
killedBy: issueTemplates() issueTemplates method Happy Path should return success status when issue_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "description": "You have issue templates.",
    "extra": "No action required.",

[Killed] StringLiteral
src/checks/issueTemplates.js:5:12
   let response = {
     id: "issue-templates",
     href: "/repo/issue-templates",
-    title: "Issue templates",
+    title: "",
   };
 
killedBy: issueTemplates() issueTemplates method Happy Path should return success status when issue_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "description": "You have issue templates.",
    "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/issueTemplates.js:8:7
     title: "Issue templates",
   };
 
-  if (communityMetrics.files.issue_template) {
+  if (false) {
     response.status = "success";
     response.description = "You have issue templates.";
killedBy: issueTemplates() issueTemplates method Happy Path should return success status when issue_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have issue templates.",
-   "extra": "No action required.",

[Killed] BlockStatement
src/checks/issueTemplates.js:8:46
     title: "Issue templates",
   };
 
-  if (communityMetrics.files.issue_template) {
-    response.status = "success";
-    response.description = "You have issue templates.";
-    response.extra = "No action required.";
-  }
+  if (communityMetrics.files.issue_template) {}
 
   if (!communityMetrics.files.issue_template) {
killedBy: issueTemplates() issueTemplates method Happy Path should return success status when issue_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have issue templates.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/issueTemplates.js:10:28
 
   if (communityMetrics.files.issue_template) {
     response.status = "success";
-    response.description = "You have issue templates.";
+    response.description = "";
     response.extra = "No action required.";
   }
killedBy: issueTemplates() issueTemplates method Happy Path should return success status when issue_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You have issue templates.",

[Killed] ConditionalExpression
src/checks/issueTemplates.js:14:7
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files.issue_template) {
+  if (false) {
     response.status = "error";
     response.description = "You do not have any issue templates in your repo.";
killedBy: issueTemplates() issueTemplates method Edge Cases should return error status when issue_template file does not exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have any issue templates in your repo.",
-   "extra": "This helps people create better issues, for example focused on a feature or bug.",

[Killed] BlockStatement
src/checks/issueTemplates.js:14:47
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files.issue_template) {
-    response.status = "error";
-    response.description = "You do not have any issue templates in your repo.";
-    response.extra =
-      "This helps people create better issues, for example focused on a feature or bug.";
-  }
+  if (!communityMetrics.files.issue_template) {}
 
   return response;
killedBy: issueTemplates() issueTemplates method Edge Cases should return error status when issue_template file does not exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have any issue templates in your repo.",
-   "extra": "This helps people create better issues, for example focused on a feature or bug.",

[Killed] StringLiteral
src/checks/issueTemplates.js:15:23
   }
 
   if (!communityMetrics.files.issue_template) {
-    response.status = "error";
+    response.status = "";
     response.description = "You do not have any issue templates in your repo.";
     response.extra =
killedBy: issueTemplates() issueTemplates method Edge Cases should return error status when issue_template file does not exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You do not have any issue templates in your repo.",
    "extra": "This helps people create better issues, for example focused on a feature or bug.",
