[Killed] StringLiteral
src/checks/issues.js:6:9
   const max = 20;
 
   let response = {
-    id: "issues",
+    id: "",
     href: "/repo/status",
     title: "Issue",
killedBy: issues() issues method Happy Path should return success status when open issues are greater than max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have open issues.",
    "extra": "No action required.",

[Killed] EqualityOperator
src/checks/issues.js:11:7
     title: "Issue",
   };
 
-  if (repo.open_issues > max) {
+  if (repo.open_issues <= max) {
     response.status = "success";
     response.description = "You have open issues.";
killedBy: issues() issues method Happy Path should return success status when open issues are greater than max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have open issues.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/issues.js:11:7
     title: "Issue",
   };
 
-  if (repo.open_issues > max) {
+  if (false) {
     response.status = "success";
     response.description = "You have open issues.";
killedBy: issues() issues method Happy Path should return success status when open issues are greater than max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have open issues.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/issues.js:12:23
   };
 
   if (repo.open_issues > max) {
-    response.status = "success";
+    response.status = "";
     response.description = "You have open issues.";
     response.extra = "No action required.";
killedBy: issues() issues method Happy Path should return success status when open issues are greater than max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have open issues.",
    "extra": "No action required.",

[Killed] EqualityOperator
src/checks/issues.js:17:34
     response.extra = "No action required.";
   }
 
-  if (repo.open_issues >= min && repo.open_issues <= max) {
+  if (repo.open_issues >= min && repo.open_issues < max) {
     response.status = "warning";
     response.description = "You have some open issues.";
killedBy: issues() issues method Edge Cases should return warning status when open issues are exactly max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have some open issues.",
-   "extra": "Are there any bugs or features ideas you have?",

[Killed] EqualityOperator
src/checks/issues.js:17:7
     response.extra = "No action required.";
   }
 
-  if (repo.open_issues >= min && repo.open_issues <= max) {
+  if (repo.open_issues < min && repo.open_issues <= max) {
     response.status = "warning";
     response.description = "You have some open issues.";
killedBy: issues() issues method Happy Path should return warning status when open issues are between min and max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have some open issues.",
-   "extra": "Are there any bugs or features ideas you have?",

[Killed] StringLiteral
src/checks/issues.js:19:28
 
   if (repo.open_issues >= min && repo.open_issues <= max) {
     response.status = "warning";
-    response.description = "You have some open issues.";
+    response.description = "";
     response.extra = "Are there any bugs or features ideas you have?";
   }
killedBy: issues() issues method Happy Path should return warning status when open issues are between min and max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You have some open issues.",

[Killed] ConditionalExpression
src/checks/issues.js:23:7
     response.extra = "Are there any bugs or features ideas you have?";
   }
 
-  if (repo.open_issues < min) {
+  if (true) {
     response.status = "error";
     response.description = "There are not enough open issues.";
killedBy: issues() issues method Happy Path should return success status when open issues are greater than max
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have open issues.",
-   "extra": "No action required.",

[Killed] EqualityOperator
src/checks/issues.js:23:7
     response.extra = "Are there any bugs or features ideas you have?";
   }
 
-  if (repo.open_issues < min) {
+  if (repo.open_issues <= min) {
     response.status = "error";
     response.description = "There are not enough open issues.";
killedBy: issues() issues method Edge Cases should return warning status when open issues are exactly min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have some open issues.",
-   "extra": "Are there any bugs or features ideas you have?",

[Killed] StringLiteral
src/checks/issues.js:24:23
   }
 
   if (repo.open_issues < min) {
-    response.status = "error";
+    response.status = "";
     response.description = "There are not enough open issues.";
     response.extra =
killedBy: issues() issues method Happy Path should return error status when open issues are less than min
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "There are not enough open issues.",
    "extra": "Try creating some more, or asking the community for ideas.",
