[Killed] StringLiteral
src/checks/labels.js:6:9
   const max = 6;
 
   let response = {
-    id: "labels",
+    id: "",
     href: "/repo/labels",
     title: "Labels",
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have multiple custom labels.",
    "extra": "No action required.",

[Killed] StringLiteral
src/checks/labels.js:7:11
 
   let response = {
     id: "labels",
-    href: "/repo/labels",
+    href: "",
     title: "Labels",
   };
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have multiple custom labels.",
    "extra": "No action required.",

[Killed] StringLiteral
src/checks/labels.js:8:12
   let response = {
     id: "labels",
     href: "/repo/labels",
-    title: "Labels",
+    title: "",
   };
 
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "description": "You have multiple custom labels.",
    "extra": "No action required.",

[Killed] EqualityOperator
src/checks/labels.js:11:7
     title: "Labels",
   };
 
-  if (labels.length >= max) {
+  if (labels.length < max) {
     response.status = "success";
     response.description = "You have multiple custom labels.";
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have multiple custom labels.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/labels.js:11:7
     title: "Labels",
   };
 
-  if (labels.length >= max) {
+  if (false) {
     response.status = "success";
     response.description = "You have multiple custom labels.";
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have multiple custom labels.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/labels.js:12:23
   };
 
   if (labels.length >= max) {
-    response.status = "success";
+    response.status = "";
     response.description = "You have multiple custom labels.";
     response.extra = "No action required.";
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have multiple custom labels.",
    "extra": "No action required.",

[Killed] StringLiteral
src/checks/labels.js:13:28
 
   if (labels.length >= max) {
     response.status = "success";
-    response.description = "You have multiple custom labels.";
+    response.description = "";
     response.extra = "No action required.";
   }
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You have multiple custom labels.",

[Killed] ConditionalExpression
src/checks/labels.js:17:30
     response.extra = "No action required.";
   }
 
-  if (labels.length > min && labels.length < max) {
+  if (labels.length > min && true) {
     response.status = "warning";
     response.description = "You might need more custom labels.";
killedBy: labels() labels method Happy Path should return success when labels length is equal to max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have multiple custom labels.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/labels.js:17:7
     response.extra = "No action required.";
   }
 
-  if (labels.length > min && labels.length < max) {
+  if (false) {
     response.status = "warning";
     response.description = "You might need more custom labels.";
killedBy: labels() labels method Happy Path should return warning when labels length is between min (3) and max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You might need more custom labels.",
-   "extra": "Try creating some more, have a look at other repos for ideas.",

[Killed] StringLiteral
src/checks/labels.js:19:28
 
   if (labels.length > min && labels.length < max) {
     response.status = "warning";
-    response.description = "You might need more custom labels.";
+    response.description = "";
     response.extra =
       "Try creating some more, have a look at other repos for ideas.";
killedBy: labels() labels method Happy Path should return warning when labels length is between min (3) and max (6)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You might need more custom labels.",

[Killed] EqualityOperator
src/checks/labels.js:24:7
       "Try creating some more, have a look at other repos for ideas.";
   }
 
-  if (labels.length <= min) {
+  if (labels.length < min) {
     response.status = "error";
     response.description = "There are not enough custom labels.";
killedBy: labels() labels method Happy Path should return error when labels length is equal to min (3)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "There are not enough custom labels.",
-   "extra": "This is useful for filtering issues.",

[Killed] ConditionalExpression
src/checks/labels.js:24:7
       "Try creating some more, have a look at other repos for ideas.";
   }
 
-  if (labels.length <= min) {
+  if (false) {
     response.status = "error";
     response.description = "There are not enough custom labels.";
killedBy: labels() labels method Happy Path should return error when labels length is equal to min (3)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "There are not enough custom labels.",
-   "extra": "This is useful for filtering issues.",

[Killed] StringLiteral
src/checks/labels.js:27:22
   if (labels.length <= min) {
     response.status = "error";
     response.description = "There are not enough custom labels.";
-    response.extra = "This is useful for filtering issues.";
+    response.extra = "";
   }
 
killedBy: labels() labels method Happy Path should return error when labels length is equal to min (3)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "There are not enough custom labels.",
-   "extra": "This is useful for filtering issues.",
