[Killed] BlockStatement
src/checks/license.js:1:51
-export default function license(communityMetrics) {
-  let response = {
-    id: "license",
-    href: "/repo/license",
-    title: "License",
-  };
-
-  if (communityMetrics.files?.license) {
-    response.status = "success";
-    response.description = `You have a license ${communityMetrics.files.license.spdx_id}.`;
-    response.extra = "No action required.";
-  }
-
-  if (!communityMetrics.files || !communityMetrics.files.license) {
-    response.status = "error";
-    response.description = "You do not have a license in your repo.";
-    response.extra = "This does not mean it is moe Open Source but less.";
-  }
-
-  return response;
-}
+export default function license(communityMetrics) {}
 
killedBy: license() license method Happy Path should return success when a license is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "You have a license MIT.", "extra": "No action required.", "href": "/repo/license", "id": "license", "status": "success", "title": "License"}
Received: undefined

[Killed] ObjectLiteral
src/checks/license.js:2:18
 export default function license(communityMetrics) {
-  let response = {
-    id: "license",
-    href: "/repo/license",
-    title: "License",
-  };
+  let response = {};
 
   if (communityMetrics.files?.license) {
killedBy: license() license method Happy Path should return success when a license is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "description": "You have a license MIT.",
    "extra": "No action required.",

[Killed] StringLiteral
src/checks/license.js:4:11
 export default function license(communityMetrics) {
   let response = {
     id: "license",
-    href: "/repo/license",
+    href: "",
     title: "License",
   };
killedBy: license() license method Happy Path should return success when a license is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a license MIT.",
    "extra": "No action required.",

[Killed] BlockStatement
src/checks/license.js:8:40
     title: "License",
   };
 
-  if (communityMetrics.files?.license) {
-    response.status = "success";
-    response.description = `You have a license ${communityMetrics.files.license.spdx_id}.`;
-    response.extra = "No action required.";
-  }
+  if (communityMetrics.files?.license) {}
 
   if (!communityMetrics.files || !communityMetrics.files.license) {
killedBy: license() license method Happy Path should return success when a license is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a license MIT.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/license.js:8:7
     title: "License",
   };
 
-  if (communityMetrics.files?.license) {
+  if (true) {
     response.status = "success";
     response.description = `You have a license ${communityMetrics.files.license.spdx_id}.`;
killedBy: license() license method Edge Cases should return error when files object is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'license')

[Killed] ConditionalExpression
src/checks/license.js:14:7
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.license) {
+  if (false) {
     response.status = "error";
     response.description = "You do not have a license in your repo.";
killedBy: license() license method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have a license in your repo.",
-   "extra": "This does not mean it is moe Open Source but less.",

[Killed] BooleanLiteral
src/checks/license.js:14:7
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.license) {
+  if (communityMetrics.files || !communityMetrics.files.license) {
     response.status = "error";
     response.description = "You do not have a license in your repo.";
killedBy: license() license method Happy Path should return success when a license is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a license MIT.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/license.js:17:22
   if (!communityMetrics.files || !communityMetrics.files.license) {
     response.status = "error";
     response.description = "You do not have a license in your repo.";
-    response.extra = "This does not mean it is moe Open Source but less.";
+    response.extra = "";
   }
 
killedBy: license() license method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You do not have a license in your repo.",
-   "extra": "This does not mean it is moe Open Source but less.",
