[Killed] BlockStatement
src/checks/pullRequestTemplate.js:1:63
-export default function pullRequestTemplate(communityMetrics) {
-  let response = {
-    id: "pull-request-template",
-    href: "/repo/pull-request-template",
-    title: "Pull Request template",
-  };
-
-  if (communityMetrics.files?.pull_request_template) {
-    response.status = "success";
-    response.description = "You have a Pull Request template.";
-    response.extra = "No action required.";
-  }
-
-  if (
-    !communityMetrics.files ||
-    !communityMetrics.files.pull_request_template
-  ) {
-    response.status = "error";
-    response.description =
-      "You do not have a pull request template in your repo.";
-    response.extra = "This helps people create better pull requests.";
-  }
-
-  return response;
-}
+export default function pullRequestTemplate(communityMetrics) {}
 
killedBy: pullRequestTemplate() pullRequestTemplate method Happy Path should return success when pull_request_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "You have a Pull Request template.", "extra": "No action required.", "href": "/repo/pull-request-template", "id": "pull-request-template", "status": "success", "title": "Pull Request template"}
Received: undefined

[Killed] StringLiteral
src/checks/pullRequestTemplate.js:3:9
 export default function pullRequestTemplate(communityMetrics) {
   let response = {
-    id: "pull-request-template",
+    id: "",
     href: "/repo/pull-request-template",
     title: "Pull Request template",
killedBy: pullRequestTemplate() pullRequestTemplate method Happy Path should return success when pull_request_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a Pull Request template.",
    "extra": "No action required.",

[Killed] OptionalChaining
src/checks/pullRequestTemplate.js:8:7
     title: "Pull Request template",
   };
 
-  if (communityMetrics.files?.pull_request_template) {
+  if (communityMetrics.files.pull_request_template) {
     response.status = "success";
     response.description = "You have a Pull Request template.";
killedBy: pullRequestTemplate() pullRequestTemplate method Edge Cases should return error when communityMetrics.files is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'pull_request_template')

[Killed] ConditionalExpression
src/checks/pullRequestTemplate.js:8:7
     title: "Pull Request template",
   };
 
-  if (communityMetrics.files?.pull_request_template) {
+  if (false) {
     response.status = "success";
     response.description = "You have a Pull Request template.";
killedBy: pullRequestTemplate() pullRequestTemplate method Happy Path should return success when pull_request_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a Pull Request template.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/pullRequestTemplate.js:11:22
   if (communityMetrics.files?.pull_request_template) {
     response.status = "success";
     response.description = "You have a Pull Request template.";
-    response.extra = "No action required.";
+    response.extra = "";
   }
 
killedBy: pullRequestTemplate() pullRequestTemplate method Happy Path should return success when pull_request_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a Pull Request template.",
-   "extra": "No action required.",

[Killed] BooleanLiteral
src/checks/pullRequestTemplate.js:15:5
   }
 
   if (
-    !communityMetrics.files ||
+    communityMetrics.files ||
     !communityMetrics.files.pull_request_template
   ) {
killedBy: pullRequestTemplate() pullRequestTemplate method Happy Path should return success when pull_request_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a Pull Request template.",
-   "extra": "No action required.",

[Killed] ConditionalExpression
src/checks/pullRequestTemplate.js:15:5
   }
 
   if (
-    !communityMetrics.files ||
-    !communityMetrics.files.pull_request_template
+    false
   ) {
     response.status = "error";
killedBy: pullRequestTemplate() pullRequestTemplate method Edge Cases should return error when communityMetrics.files is undefined
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have a pull request template in your repo.",
-   "extra": "This helps people create better pull requests.",

[Killed] BooleanLiteral
src/checks/pullRequestTemplate.js:16:5
 
   if (
     !communityMetrics.files ||
-    !communityMetrics.files.pull_request_template
+    communityMetrics.files.pull_request_template
   ) {
     response.status = "error";
killedBy: pullRequestTemplate() pullRequestTemplate method Happy Path should return success when pull_request_template file exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a Pull Request template.",
-   "extra": "No action required.",

[Killed] BlockStatement
src/checks/pullRequestTemplate.js:17:5
   if (
     !communityMetrics.files ||
     !communityMetrics.files.pull_request_template
-  ) {
-    response.status = "error";
-    response.description =
-      "You do not have a pull request template in your repo.";
-    response.extra = "This helps people create better pull requests.";
-  }
+  ) {}
 
   return response;
killedBy: pullRequestTemplate() pullRequestTemplate method Edge Cases should return error when communityMetrics.files is undefined
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have a pull request template in your repo.",
-   "extra": "This helps people create better pull requests.",
