[Killed] BlockStatement
src/checks/readme.js:1:50
-export default function readme(communityMetrics) {
-  let response = {
-    id: "readme",
-    href: "/repo/readme",
-    title: "Readme",
-  };
-
-  if (communityMetrics.files?.readme) {
-    response.status = "success";
-    response.description = "You have a README file.";
-    response.extra = "No action required.";
-  }
-
-  if (!communityMetrics.files || !communityMetrics.files.readme) {
-    response.status = "error";
-    response.description = "You do not have a readme.md file in your repo.";
-    response.extra = "This is the most important file in your project.";
-  }
-
-  return response;
-}
+export default function readme(communityMetrics) {}
 
killedBy: readme() readme method Happy Path should return success when a README file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "You have a README file.", "extra": "No action required.", "href": "/repo/readme", "id": "readme", "status": "success", "title": "Readme"}
Received: undefined

[Killed] OptionalChaining
src/checks/readme.js:8:7
     title: "Readme",
   };
 
-  if (communityMetrics.files?.readme) {
+  if (communityMetrics.files.readme) {
     response.status = "success";
     response.description = "You have a README file.";
killedBy: readme() readme method Edge Cases should return error when files object is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'readme')

[Killed] BlockStatement
src/checks/readme.js:8:39
     title: "Readme",
   };
 
-  if (communityMetrics.files?.readme) {
-    response.status = "success";
-    response.description = "You have a README file.";
-    response.extra = "No action required.";
-  }
+  if (communityMetrics.files?.readme) {}
 
   if (!communityMetrics.files || !communityMetrics.files.readme) {
killedBy: readme() readme method Happy Path should return success when a README file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You have a README file.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/readme.js:9:23
   };
 
   if (communityMetrics.files?.readme) {
-    response.status = "success";
+    response.status = "";
     response.description = "You have a README file.";
     response.extra = "No action required.";
killedBy: readme() readme method Happy Path should return success when a README file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You have a README file.",
    "extra": "No action required.",

[Killed] BlockStatement
src/checks/readme.js:14:66
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.readme) {
-    response.status = "error";
-    response.description = "You do not have a readme.md file in your repo.";
-    response.extra = "This is the most important file in your project.";
-  }
+  if (!communityMetrics.files || !communityMetrics.files.readme) {}
 
   return response;
killedBy: readme() readme method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
-   "description": "You do not have a readme.md file in your repo.",
-   "extra": "This is the most important file in your project.",

[Killed] BooleanLiteral
src/checks/readme.js:14:34
     response.extra = "No action required.";
   }
 
-  if (!communityMetrics.files || !communityMetrics.files.readme) {
+  if (!communityMetrics.files || communityMetrics.files.readme) {
     response.status = "error";
     response.description = "You do not have a readme.md file in your repo.";
killedBy: readme() readme method Happy Path should return success when a README file is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "You have a README file.",
-   "extra": "No action required.",

[Killed] StringLiteral
src/checks/readme.js:15:23
   }
 
   if (!communityMetrics.files || !communityMetrics.files.readme) {
-    response.status = "error";
+    response.status = "";
     response.description = "You do not have a readme.md file in your repo.";
     response.extra = "This is the most important file in your project.";
killedBy: readme() readme method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "You do not have a readme.md file in your repo.",
    "extra": "This is the most important file in your project.",

[Killed] StringLiteral
src/checks/readme.js:16:28
 
   if (!communityMetrics.files || !communityMetrics.files.readme) {
     response.status = "error";
-    response.description = "You do not have a readme.md file in your repo.";
+    response.description = "";
     response.extra = "This is the most important file in your project.";
   }
killedBy: readme() readme method Edge Cases should return error when files object is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "description": "You do not have a readme.md file in your repo.",
