[Killed] BlockStatement
src/components/report.tsx:18:63
   repoUrl: string;
   statusChecks: StatusCheck[];
 }) {
-  const StatusIcon = ({ status }: { status: CheckStatus }) => {
-    switch (status) {
-      case "success":
-        return <CheckCircle2 color="green" />;
-      case "error":
-        return <XCircle color="red" />;
-      case "warning":
-        return <AlertCircle color="orange" />;
-    }
-  };
+  const StatusIcon = ({ status }: { status: CheckStatus }) => {};
 
   return (
killedBy: Report() Report method Happy Path should render the report with success status icon
statusReason: TestingLibraryElementError: Unable to find an element with the text: CheckCircle2 Icon. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg border bg-card text-card-foreground shadow-sm mt-4"
    >

[Killed] ConditionalExpression
src/components/report.tsx:20:7
 }) {
   const StatusIcon = ({ status }: { status: CheckStatus }) => {
     switch (status) {
-      case "success":
-        return <CheckCircle2 color="green" />;
+      case "success":
       case "error":
         return <XCircle color="red" />;
killedBy: Report() Report method Happy Path should render the report with success status icon
statusReason: TestingLibraryElementError: Unable to find an element with the text: CheckCircle2 Icon. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg border bg-card text-card-foreground shadow-sm mt-4"
    >

[Killed] ConditionalExpression
src/components/report.tsx:22:7
     switch (status) {
       case "success":
         return <CheckCircle2 color="green" />;
-      case "error":
-        return <XCircle color="red" />;
+      case "error":
       case "warning":
         return <AlertCircle color="orange" />;
killedBy: Report() Report method Happy Path should render the report with error status icon
statusReason: TestingLibraryElementError: Unable to find an element with the text: XCircle Icon. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg border bg-card text-card-foreground shadow-sm mt-4"
    >

[Killed] ConditionalExpression
src/components/report.tsx:24:7
         return <CheckCircle2 color="green" />;
       case "error":
         return <XCircle color="red" />;
-      case "warning":
-        return <AlertCircle color="orange" />;
+      case "warning":
     }
   };
killedBy: Report() Report method Happy Path should render the report with warning status icon
statusReason: TestingLibraryElementError: Unable to find an element with the text: AlertCircle Icon. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg border bg-card text-card-foreground shadow-sm mt-4"
    >

[Killed] ArrowFunction
src/components/report.tsx:37:29
       </CardHeader>
       <CardContent>
         <ul className="space-y-4">
-          {statusChecks.map((check, index) => (
-            <li key={index} className="flex items-start space-x-2">
-              <StatusIcon status={check.status} />
-              <div>
-                <h3 className="font-semibold">{check.title}</h3>
-                <p className="text-sm text-gray-600">{check.description}</p>
-              </div>
-            </li>
-          ))}
+          {statusChecks.map(() => undefined)}
         </ul>
       </CardContent>
killedBy: Report() Report method Happy Path should render the report with success status icon
statusReason: TestingLibraryElementError: Unable to find an element with the text: Check 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg border bg-card text-card-foreground shadow-sm mt-4"
    >
